#+TITLE: Kyonax's Doom Emacs Config
#+AUTHOR: Kyonax - Cristian Moreno
#+PROPERTY: header-args :tangle config.el
#+auto_tangle: t
#+DESCRIPTION: Kyonax's personal Doom Emacs Config.
#+STARTUP: showeverything
#+VERSION: v0.1

** PDF View Configuration
PDF Viewer

#+BEGIN_SRC emacs-lisp :tangle no
(use-package pdf-view
  :hook (pdf-tools-enabled . pdf-view-midnight-minor-mode)
  :hook (pdf-tools-enabled . hide-mode-line-mode)
  :config
  (setq pdf-view-midnight-colors '("#ABB2BF" . "#282C35")))
#+END_SRC
#+RESULTS:
| latex | (:inherit default :extend t) |

